Revit 2024 API
RepeaterBounds.DimensionCount Property
 The number of dimensions of the bounds (0, 1 or 2 for zero, one or two dimensional arrays.)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public int DimensionCount { get; }
Visual Basic
Public ReadOnly Property DimensionCount As Integer
	Get
Visual C++
public:
property int DimensionCount {
	int get ();
}
See Also
RepeaterBounds Class
Autodesk.Revit.DB Namespace